engemil/ee_stm32_bootloader/bootloader/src/usb_dfu.c
/*
MIT License

Copyright (c) 2026 EngEmil

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

/**
 * @file usb_dfu.c
 * @brief USB DFU (Device Firmware Update) implementation using ChibiOS
 * 
 * This implements USB DFU 1.1 protocol for EngEmil STM32 Bootloader.
 * Uses ChibiOS USB stack for reliable USB communication.
 */

#include "ch.h"
#include "hal.h"
#include "usb_dfu.h"
#include "config.h"
#include "flash_ops.h"
#include "bootloader.h"
#include "stm32c071xx.h"
#include <string.h>

/*===========================================================================*/
/* USB DFU Class-Specific Descriptors                                       */
/*===========================================================================*/

/* DFU Functional Descriptor */
#define DFU_DESC_FUNCTIONAL_SIZE    9

/* DFU Attributes */
#define DFU_ATTR_CAN_DOWNLOAD       0x01
#define DFU_ATTR_CAN_UPLOAD         0x02
#define DFU_ATTR_WILL_DETACH        0x08

/* DFU Class-Specific Requests (bmRequestType = 0x21 for Class/Interface/Host-to-Device) */
#define USB_RTYPE_DFU_REQUEST       (USB_RTYPE_DIR_HOST2DEV | \
                                     USB_RTYPE_TYPE_CLASS | \
                                     USB_RTYPE_RECIPIENT_INTERFACE)

/*===========================================================================*/
/* DFU Context                                                               */
/*===========================================================================*/

static struct {
    dfu_state_t state;
    dfu_status_t status;
    uint32_t current_address;
    uint32_t target_address;       /* For DFUSe Set Address command (0x21) */
    uint16_t block_num;
    uint8_t buffer[DFU_XFER_SIZE] __attribute__((aligned(4)));  /* 4-byte aligned for flash writes */
    uint16_t buffer_len;
    bool download_complete;
    bool erase_done;                /* Track if explicit erase was performed */
    uint32_t poll_timeout;  /* Time in milliseconds for flash operation */
} dfu_ctx;

/*===========================================================================*/
/* USB Descriptors                                                           */
/*===========================================================================*/

/**
 * @brief Device Descriptor (mutable for dynamic VID/PID)
 * 
 * VID and PID are read from the application header if a valid application
 * is present (magic == 0xDEADBEEF). Otherwise, defaults from config.h are used.
 * 
 * VID/PID are at byte offsets 8-9 (VID) and 10-11 (PID) in little-endian format.
 */
static uint8_t vcom_device_descriptor_data[18] = {
    USB_DESC_DEVICE(0x0200,        /* bcdUSB (2.0)                    */
                    0x00,           /* bDeviceClass (per interface)    */
                    0x00,           /* bDeviceSubClass                 */
                    0x00,           /* bDeviceProtocol                 */
                    USB_PACKET_SIZE, /* bMaxPacketSize                 */
                    USB_DEFAULT_VID, /* idVendor (patched at runtime)  */
                    USB_DEFAULT_PID, /* idProduct (patched at runtime) */
                    0x0100,         /* bcdDevice                       */
                    1,              /* iManufacturer                   */
                    2,              /* iProduct                        */
                    3,              /* iSerialNumber                   */
                    1)              /* bNumConfigurations              */
};

/**
 * @brief Device Descriptor wrapper
 */
static USBDescriptor vcom_device_descriptor = {
    sizeof vcom_device_descriptor_data,
    vcom_device_descriptor_data
};

/**
 * @brief Get USB VID/PID from application header or use defaults
 * 
 * If a valid application is present (magic == APP_HEADER_MAGIC) and the
 * VID/PID fields contain sane values, those are used. This allows each
 * application to define its own USB identity that the bootloader inherits
 * in DFU mode.
 * 
 * Falls back to USB_DEFAULT_VID/PID (STM32 DFU) when:
 * - No valid application header (blank/erased flash)
 * - VID/PID values are 0x0000 or 0xFFFF (erased/uninitialised)
 * 
 * @param[out] vid  Pointer to store USB Vendor ID
 * @param[out] pid  Pointer to store USB Product ID
 */
static void get_usb_vid_pid(uint16_t *vid, uint16_t *pid) {
    const app_header_t *header = (const app_header_t *)APP_BASE;

    if (header->magic == APP_HEADER_MAGIC &&
        header->usb_vid != 0x0000 && header->usb_vid != 0xFFFF &&
        header->usb_pid != 0x0000 && header->usb_pid != 0xFFFF) {
        /* Valid application header with sane VID/PID */
        *vid = header->usb_vid;
        *pid = header->usb_pid;
    } else {
        /* No valid application or invalid VID/PID - use defaults */
        *vid = USB_DEFAULT_VID;
        *pid = USB_DEFAULT_PID;
    }
}

/**
 * @brief Configuration Descriptor with DFU Interface
 */
static const uint8_t vcom_configuration_descriptor_data[27] = {
    /* Configuration Descriptor (9 bytes) */
    USB_DESC_CONFIGURATION(27,              /* wTotalLength (9+9+9)        */
                           1,                /* bNumInterfaces              */
                           1,                /* bConfigurationValue         */
                           0,                /* iConfiguration              */
                           0x80,             /* bmAttributes (bus powered)  */
                           50),              /* bMaxPower (100mA)           */
    
    /* Interface Descriptor (9 bytes) */
    USB_DESC_INTERFACE(0,                   /* bInterfaceNumber            */
                       0,                   /* bAlternateSetting           */
                       0,                   /* bNumEndpoints (DFU uses EP0)*/
                       0xFE,                /* bInterfaceClass (App Spec)  */
                       0x01,                /* bInterfaceSubClass (DFU)    */
                       0x02,                /* bInterfaceProtocol (DFU)    */
                       4),                  /* iInterface                  */
    
    /* DFU Functional Descriptor (9 bytes) */
    USB_DESC_BYTE(DFU_DESC_FUNCTIONAL_SIZE),        /* bLength             */
    USB_DESC_BYTE(0x21),                            /* bDescriptorType (DFU)*/
    USB_DESC_BYTE(DFU_ATTR_CAN_DOWNLOAD |          /* bmAttributes         */
                  DFU_ATTR_WILL_DETACH),
    USB_DESC_WORD(255),                             /* wDetachTimeout (ms)  */
    USB_DESC_WORD(DFU_XFER_SIZE),                   /* wTransferSize        */
    USB_DESC_BCD(0x011A)                            /* bcdDFUVersion (1.1a) */
};

/**
 * @brief Configuration Descriptor wrapper
 */
static const USBDescriptor vcom_configuration_descriptor = {
    sizeof vcom_configuration_descriptor_data,
    vcom_configuration_descriptor_data
};

/**
 * @brief String Descriptors
 */
static const uint8_t vcom_string0[] = {
    USB_DESC_BYTE(4),                       /* bLength                      */
    USB_DESC_BYTE(USB_DESCRIPTOR_STRING),   /* bDescriptorType              */
    USB_DESC_WORD(0x0409)                   /* wLANGID (US English)         */
};

static const uint8_t vcom_string1[] = {
    USB_DESC_BYTE(22),                      /* bLength (2 + 10*2)           */
    USB_DESC_BYTE(USB_DESCRIPTOR_STRING),   /* bDescriptorType              */
    'E', 0, 'n', 0, 'g', 0, 'E', 0, 'm', 0, 'i', 0, 'l', 0, '.', 0,
    'i', 0, 'o', 0
};

static const uint8_t vcom_string2[] = {
    USB_DESC_BYTE(40),                      /* bLength (2 + 19*2)           */
    USB_DESC_BYTE(USB_DESCRIPTOR_STRING),   /* bDescriptorType              */
    'B', 0, 'o', 0, 'o', 0, 't', 0, 'l', 0, 'o', 0, 'a', 0, 'd', 0,
    'e', 0, 'r', 0, ' ', 0, 'D', 0, 'F', 0, 'U', 0, ' ', 0, 'M', 0,
    'o', 0, 'd', 0, 'e', 0
};

