engemil/ee_stm32_bootloader/bootloader/src/usb_dfu.c
/*
 * Serial Number string.
 * Populated at runtime from the STM32 96-bit unique device ID (UID).
 * Format: 24 uppercase hex characters (3 x 32-bit words).
 * Buffer size: 2 (header) + 24 * 2 (UTF-16LE) = 50 bytes.
 */
static uint8_t vcom_string3[50];

/* DFUSe interface string descriptor */
/* Format: @Internal Flash  /0x08004000/112*001Kg */
static const uint8_t vcom_string4[] = {
    USB_DESC_BYTE(78),                      /* bLength (2 + 38*2)           */
    USB_DESC_BYTE(USB_DESCRIPTOR_STRING),   /* bDescriptorType              */
    '@', 0, 'I', 0, 'n', 0, 't', 0, 'e', 0, 'r', 0, 'n', 0, 'a', 0,
    'l', 0, ' ', 0, 'F', 0, 'l', 0, 'a', 0, 's', 0, 'h', 0, ' ', 0,
    ' ', 0, '/', 0, '0', 0, 'x', 0, '0', 0, '8', 0, '0', 0, '0', 0,
    '4', 0, '0', 0, '0', 0, '0', 0, '/', 0, '1', 0, '1', 0, '2', 0,
    '*', 0, '0', 0, '0', 0, '1', 0, 'K', 0, 'g', 0
};

/**
 * @brief String Descriptors array
 * @note  Not const because vcom_string3 (serial number) is populated at runtime.
 */
static USBDescriptor vcom_strings[] = {
    {sizeof vcom_string0, vcom_string0},
    {sizeof vcom_string1, vcom_string1},
    {sizeof vcom_string2, vcom_string2},
    {sizeof vcom_string3, vcom_string3},
    {sizeof vcom_string4, vcom_string4}
};

/*===========================================================================*/
/* USB Driver Configuration                                                  */
/*===========================================================================*/

/**
 * @brief Get descriptor callback
 */
static const USBDescriptor *get_descriptor(USBDriver *usbp,
                                           uint8_t dtype,
                                           uint8_t dindex,
                                           uint16_t lang) {
    (void)usbp;
    (void)lang;

    switch (dtype) {
    case USB_DESCRIPTOR_DEVICE:
        return &vcom_device_descriptor;
    case USB_DESCRIPTOR_CONFIGURATION:
        return &vcom_configuration_descriptor;
    case USB_DESCRIPTOR_STRING:
        if (dindex < 5)
            return &vcom_strings[dindex];
        break;
    }
    return NULL;
}

/**
 * @brief DFU Request Handler Forward Declaration
 */
static bool dfu_request_hook(USBDriver *usbp);

/**
 * @brief USB Event Callback
 */
static void usb_event(USBDriver *usbp, usbevent_t event) {
    (void)usbp;

    switch (event) {
    case USB_EVENT_RESET:
        /* Reset DFU state on USB reset */
        dfu_ctx.state = DFU_STATE_DFU_IDLE;
        dfu_ctx.status = DFU_STATUS_OK;
        return;
    case USB_EVENT_ADDRESS:
        return;
    case USB_EVENT_CONFIGURED:
        /* USB configured - ready for DFU */
        return;
    case USB_EVENT_SUSPEND:
        return;
    case USB_EVENT_WAKEUP:
        return;
    case USB_EVENT_STALLED:
        return;
    case USB_EVENT_UNCONFIGURED:
        return;
    }
}

/**
 * @brief USB Driver Configuration
 */
static const USBConfig usbcfg = {
    usb_event,
    get_descriptor,
    dfu_request_hook,
    NULL
};

/*===========================================================================*/
/* DFU Protocol Implementation                                               */
/*===========================================================================*/

/**
 * @brief Process DFU_DNLOAD request
 * 
 * Handles both DFUSe special commands (wValue=0) and regular data blocks (wValue>=2).
 * DFUSe commands: 0x21 (Set Address), 0x41 (Erase)
 */
static void dfu_dnload_handler(USBDriver *usbp, uint16_t wValue, uint16_t wLength) {
    /* Check valid states */
    if (dfu_ctx.state != DFU_STATE_DFU_IDLE &&
        dfu_ctx.state != DFU_STATE_DFU_DNLOAD_IDLE) {
        dfu_ctx.status = DFU_STATUS_ERR_STALLEDPKT;
        dfu_ctx.state = DFU_STATE_DFU_ERROR;
        usbStallReceiveI(usbp, 0);
        return;
    }

    /* Zero-length packet = download complete */
    if (wLength == 0) {
        dfu_ctx.state = DFU_STATE_DFU_MANIFEST_SYNC;
        dfu_ctx.download_complete = true;
        usbSetupTransfer(usbp, NULL, 0, NULL);
        return;
    }

    /* Check transfer size */
    if (wLength > DFU_XFER_SIZE) {
        dfu_ctx.status = DFU_STATUS_ERR_STALLEDPKT;
        dfu_ctx.state = DFU_STATE_DFU_ERROR;
        usbStallReceiveI(usbp, 0);
        return;
    }

    /* DFUSe special commands: wValue == 0 */
    if (wValue == 0) {
        /* Mark as special command for usb_dfu_process() */
        dfu_ctx.block_num = 0xFFFF;  /* Sentinel value for special command */
        dfu_ctx.buffer_len = wLength;
        dfu_ctx.state = DFU_STATE_DFU_DNLOAD_SYNC;
        usbSetupTransfer(usbp, dfu_ctx.buffer, wLength, NULL);
        return;
    }

    /* Regular data block: wValue >= 2 */
    dfu_ctx.block_num = wValue;
    dfu_ctx.buffer_len = wLength;
    dfu_ctx.state = DFU_STATE_DFU_DNLOAD_SYNC;
    usbSetupTransfer(usbp, dfu_ctx.buffer, wLength, NULL);
}

/**
 * @brief Process DFU_GETSTATUS request
 */
static void dfu_getstatus_handler(USBDriver *usbp) {
    static uint8_t status_response[6];

    /* Transition state machine based on current state */
    if (dfu_ctx.state == DFU_STATE_DFU_DNLOAD_SYNC) {
        /* Flash operation in progress - transition to DNBUSY */
        
        /* Set poll timeout based on operation type */
        if (dfu_ctx.block_num == 0xFFFF) {
            /* Special command - longer timeout for erase operations */
            dfu_ctx.poll_timeout = 2000;  /* 2 seconds for full app erase */
        } else {
            /* Regular data block write - short timeout */
            dfu_ctx.poll_timeout = 10;  /* 10ms flash write */
        }
        
        dfu_ctx.state = DFU_STATE_DFU_DNBUSY;
    } else if (dfu_ctx.state == DFU_STATE_DFU_DNBUSY) {
        /* Only transition out of DNBUSY if buffer is empty (work completed) */
        if (dfu_ctx.buffer_len == 0) {
            /* Flash operation complete */
            if (dfu_ctx.status == DFU_STATUS_OK) {
                dfu_ctx.state = DFU_STATE_DFU_DNLOAD_IDLE;
            } else {
                dfu_ctx.state = DFU_STATE_DFU_ERROR;
            }
        }
        /* else: still busy, stay in DNBUSY state */
    } else if (dfu_ctx.state == DFU_STATE_DFU_MANIFEST_SYNC) {
        dfu_ctx.state = DFU_STATE_DFU_MANIFEST;
        dfu_ctx.poll_timeout = 0;
    }

    status_response[0] = (uint8_t)dfu_ctx.status;        /* bStatus */
    status_response[1] = (uint8_t)(dfu_ctx.poll_timeout & 0xFF);  /* bwPollTimeout[0] */
    status_response[2] = (uint8_t)((dfu_ctx.poll_timeout >> 8) & 0xFF);  /* bwPollTimeout[1] */
    status_response[3] = (uint8_t)((dfu_ctx.poll_timeout >> 16) & 0xFF); /* bwPollTimeout[2] */
    status_response[4] = (uint8_t)dfu_ctx.state;         /* bState */
    status_response[5] = 0;                              /* iString */

    usbSetupTransfer(usbp, status_response, 6, NULL);
}

/**
 * @brief Process DFU_CLRSTATUS request
 */
static void dfu_clrstatus_handler(USBDriver *usbp) {
    if (dfu_ctx.state == DFU_STATE_DFU_ERROR) {
        dfu_ctx.state = DFU_STATE_DFU_IDLE;
        dfu_ctx.status = DFU_STATUS_OK;
    }
    usbSetupTransfer(usbp, NULL, 0, NULL);
}

/**
 * @brief Process DFU_GETSTATE request
 */
static void dfu_getstate_handler(USBDriver *usbp) {
    static uint8_t state_response[1];
    state_response[0] = (uint8_t)dfu_ctx.state;
    usbSetupTransfer(usbp, state_response, 1, NULL);
}

/**
 * @brief Process DFU_ABORT request
 */
static void dfu_abort_handler(USBDriver *usbp) {
    dfu_ctx.state = DFU_STATE_DFU_IDLE;
    dfu_ctx.status = DFU_STATUS_OK;
    dfu_ctx.block_num = 0;
    dfu_ctx.current_address = APP_BASE;
    dfu_ctx.target_address = APP_BASE;
    dfu_ctx.erase_done = false;
    usbSetupTransfer(usbp, NULL, 0, NULL);
}

/**
 * @brief DFU Class-Specific Request Hook
 */
static bool dfu_request_hook(USBDriver *usbp) {
    /* Handle only DFU class requests */
    if ((usbp->setup[0] & USB_RTYPE_TYPE_MASK) != USB_RTYPE_TYPE_CLASS) {
        return false;
    }

    uint8_t bRequest = usbp->setup[1];
    uint16_t wValue = (usbp->setup[3] << 8) | usbp->setup[2];
    uint16_t wLength = (usbp->setup[7] << 8) | usbp->setup[6];

    switch (bRequest) {
    case DFU_REQ_DNLOAD:
        /* Reset timeout only on actual download activity */
        bootloader_timeout_reset();
        dfu_dnload_handler(usbp, wValue, wLength);
        return true;

    case DFU_REQ_GETSTATUS:
        /* Passive host polling - do not reset timeout */
        dfu_getstatus_handler(usbp);
        return true;

    case DFU_REQ_CLRSTATUS:
        /* User is recovering from error - reset timeout */
        bootloader_timeout_reset();
        dfu_clrstatus_handler(usbp);
        return true;

