engemil/ee_stm32_bootloader/bootloader/src/usb_dfu.c
    case DFU_REQ_GETSTATE:
        /* Passive host polling - do not reset timeout */
        dfu_getstate_handler(usbp);
        return true;

    case DFU_REQ_ABORT:
        dfu_abort_handler(usbp);
        return true;

    case DFU_REQ_DETACH:
        /* Detach not needed - already in DFU mode */
        usbSetupTransfer(usbp, NULL, 0, NULL);
        return true;

    default:
        return false;
    }
}

/*===========================================================================*/
/* Public API Implementation                                                 */
/*===========================================================================*/

/**
 * @brief   Populate USB serial number string descriptor from STM32 chip UID.
 * @note    Reads the 96-bit unique device ID from UID_BASE (0x1FFF7550)
 *          and formats it as 24 uppercase hex characters in a USB string
 *          descriptor (UTF-16LE).
 */
static void set_serial_from_uid(void) {
    static const char hex_chars[] = "0123456789ABCDEF";
    const uint32_t *uid = (const uint32_t *)UID_BASE;
    uint8_t hex_str[24];
    unsigned i;

    /* Format 3 x 32-bit UID words as 24 uppercase hex characters. */
    for (i = 0; i < 3; i++) {
        uint32_t w = uid[i];
        hex_str[i * 8 + 0] = hex_chars[(w >> 28) & 0xFU];
        hex_str[i * 8 + 1] = hex_chars[(w >> 24) & 0xFU];
        hex_str[i * 8 + 2] = hex_chars[(w >> 20) & 0xFU];
        hex_str[i * 8 + 3] = hex_chars[(w >> 16) & 0xFU];
        hex_str[i * 8 + 4] = hex_chars[(w >> 12) & 0xFU];
        hex_str[i * 8 + 5] = hex_chars[(w >>  8) & 0xFU];
        hex_str[i * 8 + 6] = hex_chars[(w >>  4) & 0xFU];
        hex_str[i * 8 + 7] = hex_chars[(w >>  0) & 0xFU];
    }

    /* Build USB string descriptor: header + UTF-16LE characters. */
    vcom_string3[0] = (uint8_t)sizeof(vcom_string3);   /* bLength (50)              */
    vcom_string3[1] = USB_DESCRIPTOR_STRING;            /* bDescriptorType           */
    for (i = 0; i < 24; i++) {
        vcom_string3[2 + i * 2]     = hex_str[i];      /* ASCII character           */
        vcom_string3[2 + i * 2 + 1] = 0;               /* UTF-16LE high byte        */
    }
}

/**
 * @brief Initialize USB DFU
 */
int usb_dfu_init(void) {
    /* Initialize DFU context */
    dfu_ctx.state = DFU_STATE_DFU_IDLE;
    dfu_ctx.status = DFU_STATUS_OK;
    dfu_ctx.current_address = APP_BASE;
    dfu_ctx.target_address = APP_BASE;
    dfu_ctx.block_num = 0;
    dfu_ctx.buffer_len = 0;
    dfu_ctx.download_complete = false;
    dfu_ctx.erase_done = false;
    dfu_ctx.poll_timeout = 0;

    /* Get VID/PID from application header (or use defaults) */
    uint16_t vid, pid;
    get_usb_vid_pid(&vid, &pid);
    
    /* Patch device descriptor with VID/PID (little-endian at offsets 8-11) */
    vcom_device_descriptor_data[8]  = (uint8_t)(vid & 0xFF);
    vcom_device_descriptor_data[9]  = (uint8_t)((vid >> 8) & 0xFF);
    vcom_device_descriptor_data[10] = (uint8_t)(pid & 0xFF);
    vcom_device_descriptor_data[11] = (uint8_t)((pid >> 8) & 0xFF);

    /* Populate USB serial number from chip UID before USB starts */
    set_serial_from_uid();

    /* Initialize USB driver */
    usbDisconnectBus(&USBD1);
    chThdSleepMilliseconds(100);
    usbStart(&USBD1, &usbcfg);
    usbConnectBus(&USBD1);

    return ERR_SUCCESS;
}

/**
 * @brief Process USB DFU events
 * 
 * This should be called periodically in main loop to:
 * - Process DFUSe special commands (0x21 Set Address, 0x41 Erase)
 * - Write buffered firmware data to flash
 */
void usb_dfu_process(void) {
    /* Check if we have data to process */
    if (dfu_ctx.state == DFU_STATE_DFU_DNBUSY && dfu_ctx.buffer_len > 0) {
        
        /* Handle DFUSe special commands (block_num == 0xFFFF) */
        if (dfu_ctx.block_num == 0xFFFF) {
            uint8_t cmd = dfu_ctx.buffer[0];
            
            /* Parse command */
            switch (cmd) {
            case DFUSE_CMD_SET_ADDRESS:  /* 0x21 - Set Address Pointer */
                if (dfu_ctx.buffer_len == 5) {
                    /* Extract 32-bit address (little-endian) */
                    dfu_ctx.target_address = (dfu_ctx.buffer[1] << 0)  |
                                              (dfu_ctx.buffer[2] << 8)  |
                                              (dfu_ctx.buffer[3] << 16) |
                                              (dfu_ctx.buffer[4] << 24);
                    
                    /* Validate address is in application region */
                    if (dfu_ctx.target_address < APP_BASE || 
                        dfu_ctx.target_address >= (APP_BASE + APP_MAX_SIZE)) {
                        dfu_ctx.status = DFU_STATUS_ERR_ADDRESS;
                        dfu_ctx.state = DFU_STATE_DFU_ERROR;
                        return;
                    }
                    
                    dfu_ctx.current_address = dfu_ctx.target_address;
                    dfu_ctx.status = DFU_STATUS_OK;
                } else {
                    /* Invalid command length */
                    dfu_ctx.status = DFU_STATUS_ERR_STALLEDPKT;
                    dfu_ctx.state = DFU_STATE_DFU_ERROR;
                    return;
                }
                break;
                
            case DFUSE_CMD_ERASE:  /* 0x41 - Erase Page */
                if (dfu_ctx.buffer_len == 5) {
                    /* Extract address (for validation, we erase entire app region) */
                    uint32_t erase_addr = (dfu_ctx.buffer[1] << 0)  |
                                           (dfu_ctx.buffer[2] << 8)  |
                                           (dfu_ctx.buffer[3] << 16) |
                                           (dfu_ctx.buffer[4] << 24);
                    
                    /* Validate address is in application region */
                    if (erase_addr < APP_BASE || 
                        erase_addr >= (APP_BASE + APP_MAX_SIZE)) {
                        dfu_ctx.status = DFU_STATUS_ERR_ADDRESS;
                        dfu_ctx.state = DFU_STATE_DFU_ERROR;
                        return;
                    }
                    
                    /* Unlock flash */
                    if (flash_unlock() != ERR_SUCCESS) {
                        dfu_ctx.status = DFU_STATUS_ERR_PROG;
                        dfu_ctx.state = DFU_STATE_DFU_ERROR;
                        return;
                    }
                    
                    /* Erase entire application region (112KB) */
                    if (flash_erase_pages(APP_BASE, APP_MAX_SIZE) != ERR_SUCCESS) {
                        flash_lock();
                        dfu_ctx.status = DFU_STATUS_ERR_ERASE;
                        dfu_ctx.state = DFU_STATE_DFU_ERROR;
                        return;
                    }
                    
