engemil/ee_stm32_bootloader/bootloader/src/usb_dfu.c
                    /* Clear ALL flash status flags after erase */
                    FLASH->SR = FLASH_SR_WRPERR | FLASH_SR_PROGERR | FLASH_SR_EOP;
                    
                    /* LOCK flash after erase (will unlock again for write) */
                    flash_lock();
                    
                    dfu_ctx.erase_done = true;
                    dfu_ctx.current_address = APP_BASE;  /* Reset address for sequential writes */
                    dfu_ctx.status = DFU_STATUS_OK;
                } else {
                    dfu_ctx.status = DFU_STATUS_ERR_STALLEDPKT;
                    dfu_ctx.state = DFU_STATE_DFU_ERROR;
                    return;
                }
                break;
                
            default:
                /* Unknown command */
                dfu_ctx.status = DFU_STATUS_ERR_STALLEDPKT;
                dfu_ctx.state = DFU_STATE_DFU_ERROR;
                return;
            }
            
            /* Command processed, clear buffer */
            dfu_ctx.buffer_len = 0;
            return;
        }
        
        /* Handle regular data blocks */
        
        /* Auto-erase fallback on first data block (block 2) if no explicit erase */
        if (!dfu_ctx.erase_done && dfu_ctx.block_num == 2) {
            /* Block 0-1 reserved for DFUSe commands, data starts at block 2 */
            if (flash_unlock() != ERR_SUCCESS) {
                dfu_ctx.status = DFU_STATUS_ERR_PROG;
                dfu_ctx.state = DFU_STATE_DFU_ERROR;
                return;
            }
            
            if (flash_erase_pages(APP_BASE, APP_MAX_SIZE) != ERR_SUCCESS) {
                flash_lock();
                dfu_ctx.status = DFU_STATUS_ERR_ERASE;
                dfu_ctx.state = DFU_STATE_DFU_ERROR;
                return;
            }
            
            flash_lock();
            dfu_ctx.erase_done = true;
            /* Initialize current_address for sequential writes */
            dfu_ctx.current_address = APP_BASE;
        }
        
        /* Use current_address for write (sequential addressing) */
        uint32_t write_addr = dfu_ctx.current_address;
        
        /* Validate address range */
        if (!flash_is_app_region(write_addr, dfu_ctx.buffer_len)) {
            dfu_ctx.status = DFU_STATUS_ERR_ADDRESS;
            dfu_ctx.state = DFU_STATE_DFU_ERROR;
            return;
        }
        
        /* Sanity check: ensure we have data to write */
        if (dfu_ctx.buffer_len == 0 || dfu_ctx.buffer_len > DFU_XFER_SIZE) {
            dfu_ctx.status = DFU_STATUS_ERR_STALLEDPKT;
            dfu_ctx.state = DFU_STATE_DFU_ERROR;
            return;
        }

        /* Unlock flash for writing (safe to call multiple times) */
        if (flash_unlock() != ERR_SUCCESS) {
            dfu_ctx.status = DFU_STATUS_ERR_PROG;
            dfu_ctx.state = DFU_STATE_DFU_ERROR;
            return;
        }
        
        /* Write firmware block to flash (no erase - already done) */
        if (flash_write(write_addr, dfu_ctx.buffer, dfu_ctx.buffer_len) != ERR_SUCCESS) {
            flash_lock();
            dfu_ctx.status = DFU_STATUS_ERR_WRITE;
            dfu_ctx.state = DFU_STATE_DFU_ERROR;
            return;
        }
        
        /* Lock flash */
        flash_lock();
        
        /* Advance address for next block */
        dfu_ctx.current_address += dfu_ctx.buffer_len;

        /* Clear buffer */
        dfu_ctx.buffer_len = 0;
        dfu_ctx.status = DFU_STATUS_OK;
    }
}

/**
 * @brief Get current DFU state
 */
dfu_state_t usb_dfu_get_state(void) {
    return dfu_ctx.state;
}

/**
 * @brief Check if DFU download is complete
 */
bool usb_dfu_download_complete(void) {
    return dfu_ctx.download_complete;
}
